const title = {
  id: 0,
  name: "Черепашки-ніндзя",
  bandage: "",
  weapon: "",
  about:
    "Місто потребує героїв. Темрява огорнула Нью-Йорк, майбутнє виглядає похмурим, поки з каналізації не піднімається та не розкриває своє призначення четвірка знедолених братів - команда з чотирьох черепах-мутантів, які навчаються мистецтву ніндзюцу. Влаштувавши свою базу у каналізації Нью-Йорка, вони борються зі злом на вулицях міста.",
  img: "./img/turtles.jpeg",
};

const turtles = [
  {
    id: 1,
    hashName: "Leonardo",
    name: "Леонардо",
    bandage: "Синій",
    weapon: "Ніндзято (які часто плутають із катанами)",
    about:
      "Неформальний лідер загону, найтехнічніший у поводженні зі зброєю, найсправедливіший та врівноважений із чотирьох героїв — іноді навіть занадто, що робить його трохи занудним. Часто свариться з Рафаелем через його запальність. Рафаель фізично набагато сильніший, проте через свою агресію та емоційність часто програє своєму холоднокровному братові.",
    img: "./img/leo.png",
  },
  {
    id: 2,
    hashName: "Donatello",
    name: "Донателло",
    bandage: "Фіолетовий",
    weapon: "Палиця Бо",
    about:
      "Мозок команди, найвищий щабель розвитку гіка - мязистий ботанік. Саме завдяки Донні черепашки мають свій наворочений фургон, дирижабль, компютер та купу інших технологій. Але як учений-аматор ще частіше він стає причиною різних технологічних катастроф - у нього постійно щось горить та вибухає, а барліг черепах через це перманентно знаходиться в диму.",
    img: "./img/dony.png",
  },
  {
    id: 3,
    hashName: "Raphael",
    name: "Рафаель",
    bandage: "Червоний",
    weapon: "Сай",
    about:
      "Рафаель зазвичай досить агресивний, похмурий та настирливий. Він є одним із старших братів. Рафаель - непосида - завжди рветься вперед. Фізично набагато сильніший, проте через свою агресію та емоційність часто програє своєму холоднокровному братові.",
    img: "./img/raf.png",
  },
  {
    id: 4,
    hashName: "Michelangelo",
    name: "Мікеланджело",
    bandage: "Жовтий",
    weapon: "Нунчаки",
    about:
      "Гуморист, найбезпосередніший та безтурботний член команди, найбільше любить піцу, відеоігри, комікси, скейтборд та інші продукти медіакультури. Між ренуванням та біганині по дахах віддасть перевагу спокійному вечору біля телевізора. Але незважаючи на зовнішню розслабленість та пофігізм, у бою він безжальний.",
    img: "./img/mike.png",
  },
];

export { title, turtles };
